# SectionsCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..SectionsCount Property
MEPSystem Class See Also
---
The number of sections.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int SectionsCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SectionsCount As Integer
	Get
```

Visual C++
---
```text
public:
property int SectionsCount {
	int get ();
}
```

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace